# DataFrame

In [2]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

#data frame two dimensional
#data frame is the main tool in pandas
#pd.DataFrame[data]

In [7]:
np.random.seed(101)

#random.seed use to ensure that we get the same numbers

In [10]:
df = pd.DataFrame(randn(5,5),['A','B','C','D','E'],['Ai','Ruby','Kana','Aqua','Akane'])

#df = pd.DataFrame('data argument',['index argument'],['column argument'])

In [11]:
df

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
E  1.184817  0.851445 -0.927864 -0.679774  1.024385

In [12]:
df['Kana']

A   -0.036231
B   -0.212791
C    0.575135
D   -0.154228
E   -0.927864
Name: Kana, dtype: float64

In [14]:
type(df['Kana'])

pandas.core.series.Series

#dataframe is bunch of series that share a same index

In [21]:
df[['Ruby','Aqua','Ai']]

       Ruby      Aqua        Ai
A  2.051363 -0.019784 -0.112856
B  1.312714  0.961455 -1.062672
C -2.445938  0.336439  0.799515
D -1.542120 -1.917655  1.143517
E  0.851445 -0.679774  1.184817

#add new column

In [32]:
df['hikaru'] = df['Ai']+df['Aqua']

In [33]:
df

         Ai      Ruby      Kana      Aqua     Akane    hikaru
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617 -0.132640
B -1.062672  1.312714 -0.212791  0.961455  0.165718 -0.101217
C  0.799515 -2.445938  0.575135  0.336439 -1.574594  1.135954
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700 -0.774138
E  1.184817  0.851445 -0.927864 -0.679774  1.024385  0.505043

#removing column

In [34]:
df.drop('hikaru',axis=1,inplace=True)

#inplace = True --> modify original data

In [27]:
df

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
E  1.184817  0.851445 -0.927864 -0.679774  1.024385

In [28]:
df.drop('E')

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700

In [29]:
df

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
E  1.184817  0.851445 -0.927864 -0.679774  1.024385

In [38]:
df.shape

(5, 5)

#2 ways of selecting rows 
#loc for for labeled base location 
#iloc for index space location. for numerical base index

In [39]:
df.loc['A']

Ai      -0.112856
Ruby     2.051363
Kana    -0.036231
Aqua    -0.019784
Akane   -2.705617
Name: A, dtype: float64

In [44]:
df.iloc[0]

Ai      -0.112856
Ruby     2.051363
Kana    -0.036231
Aqua    -0.019784
Akane   -2.705617
Name: A, dtype: float64

#row comma column notation

In [43]:
df.loc['C','Aqua']

0.33643863489474635

# Conditional Selection

In [45]:
df > 0

      Ai   Ruby   Kana   Aqua  Akane
A  False   True  False  False  False
B  False   True  False   True   True
C   True  False   True   True  False
D   True  False  False  False  False
E   True   True  False  False   True

In [46]:
booldf = df >0

In [47]:
df[booldf]

         Ai      Ruby      Kana      Aqua     Akane
A       NaN  2.051363       NaN       NaN       NaN
B       NaN  1.312714       NaN  0.961455  0.165718
C  0.799515       NaN  0.575135  0.336439       NaN
D  1.143517       NaN       NaN       NaN       NaN
E  1.184817  0.851445       NaN       NaN  1.024385

In [49]:
df[df>0]

         Ai      Ruby      Kana      Aqua     Akane
A       NaN  2.051363       NaN       NaN       NaN
B       NaN  1.312714       NaN  0.961455  0.165718
C  0.799515       NaN  0.575135  0.336439       NaN
D  1.143517       NaN       NaN       NaN       NaN
E  1.184817  0.851445       NaN       NaN  1.024385

In [50]:
df

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
E  1.184817  0.851445 -0.927864 -0.679774  1.024385

In [51]:
df['Aqua']>0

A    False
B     True
C     True
D    False
E    False
Name: Aqua, dtype: bool

In [52]:
df[df['Ai']>0]

         Ai      Ruby      Kana      Aqua     Akane
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
E  1.184817  0.851445 -0.927864 -0.679774  1.024385

#it return C,D,E rows series values. rows for ai that stated to be true

In [54]:
df[df['Ai']<0]

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718

In [56]:
resultdf = df[df['Ai']<0]

In [57]:
resultdf

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718

In [58]:
resultdf['Aqua']

A   -0.019784
B    0.961455
Name: Aqua, dtype: float64

In [64]:
df[df['Aqua']>0][['Kana','Akane']]

       Kana     Akane
B -0.212791  0.165718
C  0.575135 -1.574594

#this one liner code. df[df['Aqua']>0][['Kana','Akane']]
#it is like getting the values of kana and akane from row of aqua that is stated to be true
#booleanseries = df['Aqua']>0
#result =df[booleanseries]
#column = ['Kana','Akane']

# Multiple condition

In [78]:
df[(df['Aqua']>0) & (df['Aqua']>0)]

         Ai      Ruby      Kana      Aqua     Akane
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594

In [73]:
True and False

False

In [79]:
df[(df['Aqua']>0) | (df['Aqua']>0)]

         Ai      Ruby      Kana      Aqua     Akane
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594

#note that to do multiple conditions such as example above to avoid any error use & for and. | for or
#use () to show separations

In [82]:
#Reset index 
#it will reset into numerical row value

In [81]:
df.reset_index()

  index        Ai      Ruby      Kana      Aqua     Akane
0     A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
1     B -1.062672  1.312714 -0.212791  0.961455  0.165718
2     C  0.799515 -2.445938  0.575135  0.336439 -1.574594
3     D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
4     E  1.184817  0.851445 -0.927864 -0.679774  1.024385

#create new index

In [86]:
newind = 'N E W I D'.split()

In [87]:
newind

['N', 'E', 'W', 'I', 'D']

In [88]:
df

         Ai      Ruby      Kana      Aqua     Akane
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617
B -1.062672  1.312714 -0.212791  0.961455  0.165718
C  0.799515 -2.445938  0.575135  0.336439 -1.574594
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700
E  1.184817  0.851445 -0.927864 -0.679774  1.024385

In [89]:
df['new_index'] = newind

In [90]:
df

         Ai      Ruby      Kana      Aqua     Akane new_index
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617         N
B -1.062672  1.312714 -0.212791  0.961455  0.165718         E
C  0.799515 -2.445938  0.575135  0.336439 -1.574594         W
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700         I
E  1.184817  0.851445 -0.927864 -0.679774  1.024385         D

#set index
#covert your column that you want to be new index

In [91]:
df.set_index('new_index')

                 Ai      Ruby      Kana      Aqua     Akane
new_index
N         -0.112856  2.051363 -0.036231 -0.019784 -2.705617
E         -1.062672  1.312714 -0.212791  0.961455  0.165718
W          0.799515 -2.445938  0.575135  0.336439 -1.574594
I          1.143517 -1.542120 -0.154228 -1.917655 -0.124700
D          1.184817  0.851445 -0.927864 -0.679774  1.024385

In [94]:
df

         Ai      Ruby      Kana      Aqua     Akane new_index
A -0.112856  2.051363 -0.036231 -0.019784 -2.705617         N
B -1.062672  1.312714 -0.212791  0.961455  0.165718         E
C  0.799515 -2.445938  0.575135  0.336439 -1.574594         W
D  1.143517 -1.542120 -0.154228 -1.917655 -0.124700         I
E  1.184817  0.851445 -0.927864 -0.679774  1.024385         D

In [93]:
df[df['Ruby']>0][['Kana','Akane']]

       Kana     Akane
A -0.036231 -2.705617
B -0.212791  0.165718
E -0.927864  1.024385

In [101]:
df[(df['Akane']>0)|(df['Kana']>0)]

         Ai      Ruby      Kana      Aqua     Akane new_index
B -1.062672  1.312714 -0.212791  0.961455  0.165718         E
C  0.799515 -2.445938  0.575135  0.336439 -1.574594         W
E  1.184817  0.851445 -0.927864 -0.679774  1.024385         D

In [100]:
df[(df['Ai']>0)&(df['Ruby']>0)]

         Ai      Ruby      Kana      Aqua     Akane new_index
E  1.184817  0.851445 -0.927864 -0.679774  1.024385         D

#multi index

In [105]:
out = ['B1','B1','B1','B2','B2','B2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(out,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [106]:
print(hier_index)

MultiIndex([('B1', 1),
            ('B1', 2),
            ('B1', 3),
            ('B2', 1),
            ('B2', 2),
            ('B2', 3)],
           )

In [112]:
multi_df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [117]:
multi_df

             A         B
B1 1  1.046663 -0.467685
   2  0.140567  0.462486
   3  0.488025  0.290340
B2 1  0.752003 -1.596599
   2  0.323096  0.151101
   3  0.616514  0.320661

In [116]:
#accesing the data
#calling from outside to inseide
multi_df.loc['B2'].loc[1]

A    0.752003
B   -1.596599
Name: 1, dtype: float64

In [119]:
#naming outside and inside index
multi_df.index.names = ['Group','No.']

In [120]:
multi_df

                  A         B
Group No.
B1    1    1.046663 -0.467685
      2    0.140567  0.462486
      3    0.488025  0.290340
B2    1    0.752003 -1.596599
      2    0.323096  0.151101
      3    0.616514  0.320661

In [122]:
multi_df.loc['B1'].loc[1]['A']

1.0466628605921393

In [125]:
#cross-section
multi_df.xs('B2')

            A         B
No.
1    0.752003 -1.596599
2    0.323096  0.151101
3    0.616514  0.320661

In [129]:
multi_df.xs(3,level='No.')
#it will grab all values from No. that index matches to 3
#multi_df.xs(specify what you want,level='name of index')

              A         B
Group
B1     0.488025  0.290340
B2     0.616514  0.320661